.. _rrn_userguide:

South Korean Resident Registration Numbers
==========================================

Introduction
------------

The function :func:`clean_kr_rrn() <dataprep.clean.clean_kr_rrn.clean_kr_rrn>` cleans a column containing South Korean resident registration number (RRN) strings, and standardizes them in a given format. The function :func:`validate_kr_rrn() <dataprep.clean.clean_kr_rrn.validate_kr_rrn>` validates either a single RRN strings, a column of RRN strings or a DataFrame of RRN strings, returning `True` if the value is valid, and `False` otherwise.

RRN strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "9710139019902"
* `standard`: RRN strings with proper whitespace in the proper places, like "971013-9019902"
* `birthdate`: get the person's birthdate, like "1897-10-13".

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_kr_rrn()` and `validate_kr_rrn()`.

### An example dataset containing RRN strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "rrn": [
            "971013-9019902",
            "971013-9019903",
            "999 999 999",
            "004085616",
            "002 724 334",
            "hello",
            np.nan,
            "NULL",
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "1111 S Figueroa St, Los Angeles, CA 90015",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

              rrn                                           address
0  971013-9019902                                     123 Pine Ave.
1  971013-9019903                                           main st
2     999 999 999                      1234 west main heights 57033
3       004085616                    apt 1 789 s maple rd manhattan
4     002 724 334                robie house, 789 north main street
5           hello         1111 S Figueroa St, Los Angeles, CA 90015
6             NaN  (staples center) 1111 S Figueroa St, Los Angeles
7            NULL                                             hello

## 1. Default `clean_kr_rrn`

By default, `clean_kr_rrn` will clean rrn strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_kr_rrn
clean_kr_rrn(df, column = "rrn")

,rrn,address,rrn_clean
0,971013-9019902,123 Pine Ave.,971013-9019902
1,971013-9019903,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_kr_rrn(df, column = "rrn", output_format="standard")

,rrn,address,rrn_clean
0,971013-9019902,123 Pine Ave.,971013-9019902
1,971013-9019903,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `compact`

In [4]:
clean_kr_rrn(df, column = "rrn", output_format="compact")

,rrn,address,rrn_clean
0,971013-9019902,123 Pine Ave.,9710139019902
1,971013-9019903,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `birthdate`

In [5]:
clean_kr_rrn(df, column = "rrn", output_format="birthdate")

,rrn,address,rrn_clean
0,971013-9019902,123 Pine Ave.,1897-10-13
1,971013-9019903,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned RRN strings is added with a title in the format `"{original title}_clean"`.

In [6]:
clean_kr_rrn(df, column="rrn", inplace=True)

        rrn_clean                                           address
0  971013-9019902                                     123 Pine Ave.
1             NaN                                           main st
2             NaN                      1234 west main heights 57033
3             NaN                    apt 1 789 s maple rd manhattan
4             NaN                robie house, 789 north main street
5             NaN         1111 S Figueroa St, Los Angeles, CA 90015
6             NaN  (staples center) 1111 S Figueroa St, Los Angeles
7             NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [7]:
clean_kr_rrn(df, "rrn", errors="coerce")

,rrn,address,rrn_clean
0,971013-9019902,123 Pine Ave.,971013-9019902
1,971013-9019903,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `ignore`

In [8]:
clean_kr_rrn(df, "rrn", errors="ignore")

,rrn,address,rrn_clean
0,971013-9019902,123 Pine Ave.,971013-9019902
1,971013-9019903,main st,971013-9019903
2,999 999 999,1234 west main heights 57033,999 999 999
3,004085616,apt 1 789 s maple rd manhattan,004085616
4,002 724 334,"robie house, 789 north main street",002 724 334
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",hello
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 4. `validate_kr_rrn()`

`validate_kr_rrn()` returns `True` when the input is a valid RRN. Otherwise it returns `False`.

The input of `validate_kr_rrn()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_kr_rrn()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_kr_rrn()` returns the validation result for the whole DataFrame.

In [9]:
from dataprep.clean import validate_kr_rrn
print(validate_kr_rrn("971013-9019902"))
print(validate_kr_rrn("971013-9019903"))
print(validate_kr_rrn("999 999 999"))
print(validate_kr_rrn("51824753556"))
print(validate_kr_rrn("004085616"))
print(validate_kr_rrn("hello"))
print(validate_kr_rrn(np.nan))
print(validate_kr_rrn("NULL"))

True
False
False
False
False
False
False
False

### Series

In [10]:
validate_kr_rrn(df["rrn"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: rrn, dtype: bool

### DataFrame + Specify Column

In [11]:
validate_kr_rrn(df, column="rrn")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: rrn, dtype: bool

### Only DataFrame

In [12]:
validate_kr_rrn(df)

     rrn  address
0   True    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False
7  False    False